content/post/20230802235434-json.md
+++
title = "json"
author = ["The primary user account"]
lastmod = 2024-10-19T23:16:58+02:00
draft = false
+++

## jsonPath {#jsonpath}

[JSONPath](https://goessner.net/articles/JsonPath/) expressions always refer to a JSON structure in the same way as XPath
expression are used in combination with an XML document.

example

```json
{ "store": {
    "book": [
      { "category": "reference",
        "author": "Nigel Rees",
        "title": "Sayings of the Century",
        "price": 8.95
      },
      { "category": "fiction",
        "author": "Evelyn Waugh",
        "title": "Sword of Honour",
        "price": 12.99
      },
      { "category": "fiction",
        "author": "Herman Melville",
        "title": "Moby Dick",
        "isbn": "0-553-21311-3",
        "price": 8.99
      },
      { "category": "fiction",
        "author": "J. R. R. Tolkien",
        "title": "The Lord of the Rings",
        "isbn": "0-395-19395-8",
        "price": 22.99
      }
    ],
    "bicycle": {
      "color": "red",
      "price": 19.95
    }
  }
}
```

```python
import json
from jsonpath import jsonpath

jp = json.loads(store)
jsonpath(jp, "$..author")
```

```text
['Nigel Rees', 'Evelyn Waugh', 'Herman Melville', 'J. R. R. Tolkien']
```
